[{"model": "flatpages.flatpage", "pk": 1, "fields": {"url": "/terms-and-conditions/", "title": "Terms and Conditions", "content": "<p>\r\nWelcome to fivefrets.com. If you continue to browse and use the fivefrets.com, you are agreeing to comply with and be bound by the following terms and conditions of use. If you disagree with any part of these terms and conditions, please do not use the fivefrets.com.\r\n</p>\r\n<p>\r\nThe use of fivefrets.com is subject to the following terms of use:\r\n</p>\r\n<ul class=\"ui list\">\r\n<li>The content of fivefrets.com is for your general information and use only. It is subject to change without notice. These terms and conditions may change without prior notice.</li>\r\n<li>fivefrets.com content and service may change at any time. New services or features may be added or removed without notice.</li>\r\n<li>fivefrets.com do not provide any warranty or guarantee as to the accuracy, timeliness, performance, completeness or suitability of the information and materials found on fivefrets.com for any particular purpose. You acknowledge that such information and materials may contain inaccuracies or errors and fivefrets.com expressly exclude liability for any such inaccuracies or errors to the fullest extent permitted by law.</li>\r\n<li>Your use of any information or materials of fivefrets.com is entirely at your own risk, for which fivefrets.com shall not be liable. It shall be your own responsibility to ensure that fivefrets.com meets your specific requirements.</li>\r\n<li>fivefrets.com does not host audio or video content of any kind. All chord transcriptions displayed by fivefrets.com are created automatically by open source chord extraction algorithm. No third party chord transcriptions are displayed or used in any other way by fivefrets.com. Copyright owners who do not want the chords of their works to be displayed by fivefrets.com can request the retraction of individual songs from the fivefrets.com by emailing remove@fivefrets.com. However, any songs removed from the website are at fivefrets.com discretion and should not be considered an admission of liability on fivefrets.com part</li>\r\n</ul>", "enable_comments": false, "template_name": "", "registration_required": false, "sites": [1]}}, {"model": "flatpages.flatpage", "pk": 2, "fields": {"url": "/faq/", "title": "Frequenctly Asked Questions", "content": "<div class=\"ui relaxed divided list\">\r\n\r\n<div class=\"item\">\r\n<div class=\"content\">\r\n<div class=\"header\">Does this not infringe copyright?</div>\r\n<div class=\"description\">\r\n<p>\r\nfivefrets.com automatically extracts chords from songs. Unlike lyrics or melody, chord progressions are not considered innovative or sufficiently unique enough to be copyrighted on their own. In fact, some chord progressions are particularly popular and are used in exactly the same shape by hundreds of popular songs!\r\nIn any case, copyright owners who do not want the chords of their works to be displayed by fivefrets.com can request the retraction of individual songs by emailing retract@fivefrets.com.\r\n</p>\r\n</div>\r\n</div>\r\n</div>\r\n\r\n</div>", "enable_comments": false, "template_name": "", "registration_required": false, "sites": [1]}}, {"model": "flatpages.flatpage", "pk": 3, "fields": {"url": "/about/", "title": "About", "content": "<p>\r\nfivefrets.com is an on-line music service made for music lovers to transform YouTube Musics to chords. fivefrets.com automatically recognizes chords from the audio signal, and aligns them to the music in a simple web player. fivefrets.com helps both novice and trained musicians to identify possible chords and play them quickly and for free.\r\n</p>\r\n<p>\r\nfivefrets.com used following libraries to automatically compute the chords:\r\n<ul class=\"ui list\">\r\n<li><a href=\"http://vamp-plugins.org/sonic-annotator/\">Sonic Annotator<a></li>\r\n<li><a href=\"http://isophonics.net/nnls-chroma\">NNLS Chroma</a> developed by <a href=\"http://matthiasmauch.net/\">Matthias Mauch<a></li>\r\n<li><a href=\"http://vamp-plugins.org/rdf/plugins/nnls-chroma#chordino\">Chordino</a> - a VAMP Plugin</li>\r\n<li><a href=\"http://librosa.github.io/librosa/\">LibROSA</a></li>\r\n</ul>\r\n</p>\r\n<p>\r\n<b>References and Credits</b>\r\n</p>\r\n<p>\r\nfor the NNLS Chroma method:\r\nMauch, Matthias and Dixon, Simon: <a href=\"http://schall-und-mauch.de/artificialmusicality/?p=89\">Approximate Note Transcription for the Improved Identification of Difficult Chords</a>, Proceedings of the 11th International Society for Music Information Retrieval Conference (ISMIR 2010), 2010.\r\n</p>\r\n<p>\r\nfivefrets.com is developed in Python using <a href=\"https://www.djangoproject.com/\">django</a> and obviously HTML5, CSS3 (<a href=\"http://semantic-ui.com/\">semantic-ui</a>) and Jquery.\r\n</p>\r\n<p>\r\nAnd finally my name is <a href=\"https://twitter.com/vinodronold\">Vinod Ronold</a> and working as Software Developer in NY. \r\n</p>", "enable_comments": false, "template_name": "", "registration_required": false, "sites": [1]}}]